# IdeaStatiCa.ConnectionApi.Model.ConConnectionTemplateModel

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**PlateMaterialId** | **int?** |  | [optional]
**WeldMaterialId** | **int?** |  | [optional]
**BoltAssemblyId** | **int?** |  | [optional]
**TempalteId** | **Guid** |  | [optional]
**InstanceId** | **int** |  | [optional]
**MemberIds** | **List&lt;int&gt;** |  | [optional]
**OperationIds** | **List&lt;int&gt;** |  | [optional]
**ParameterIds** | **List&lt;int&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)